РП/src/Documents/ПриемНаРаботуСписком/ПриемНаРаботуСписком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемНаРаботуСписком</name>
  <registerRecords>InformationRegister.СведенияКонтрактаДоговораСотрудника</registerRecords>
  <registerRecords>InformationRegister.ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ЗанятыеПозицииШтатногоРасписания</registerRecords>
  <registerRecords>InformationRegister.ЗначенияСовокупныхТарифныхСтавокСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПКУСотрудников</registerRecords>
  <registerRecords>InformationRegister.ГрафикРаботыСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников</registerRecords>
  <registerRecords>InformationRegister.ДанныеСостоянийСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПлановыеАвансы</registerRecords>
  <registerRecords>InformationRegister.КадроваяИсторияСотрудников</registerRecords>
  <registerRecords>InformationRegister.ОсновныеДанныеКонтрактаДоговораСотрудника</registerRecords>
  <registerRecords>InformationRegister.ЕСВСотрудников</registerRecords>
  <registerRecords>InformationRegister.ТерриторииСотрудников</registerRecords>
  <registerRecords>InformationRegister.РазрядыКатегорииСотрудников</registerRecords>
  <registerRecords>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПоложенныеВидыЕжегодныхОтпусков</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <registerRecords>InformationRegister.РеестрКадровыхПриказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачисленияУтверждены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправленныйДокумент</name>
    <type>
      <types>DocumentRef.ПриемНаРаботуСписком</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровССотрудниками</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПредставителяНанимателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БронированиеПозиции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьПоШтатномуРасписанию</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>22</precision>
          <scale>20</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятости</name>
      <type>
        <types>EnumRef.ВидыЗанятости</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьИспытательногоСрока</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаАванса</name>
      <type>
        <types>EnumRef.СпособыРасчетаАванса</types>
      </type>
    </attributes>
    <attributes>
      <name>Аванс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловияПриема</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтраженияЗарплатыВБухучете</name>
      <type>
        <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяФинансирования</name>
      <type>
        <types>CatalogRef.СтатьиФинансированияЗарплата</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокРасчетаСтоимостиЕдиницыВремени</name>
      <type>
        <types>EnumRef.ПорядокРасчетаСтоимостиЕдиницыВремениОплатыТруда</types>
      </type>
    </attributes>
    <attributes>
      <name>СовокупнаяТарифнаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидТарифнойСтавки</name>
      <type>
        <types>EnumRef.ВидыТарифныхСтавок</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрядКатегория</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрудовойДоговорНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТрудовойДоговорДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрочныйДоговор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗавершенияТрудовогоДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеСрочногоДоговора</name>
      <type>
        <types>CatalogRef.ОснованияЗаключенияСрочныхТрудовыхДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокЗаключенияДоговора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПоступленияНаСлужбу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоступлениеНаСлужбуВпервые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАктаГосоргана</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОборудованиеРабочегоМеста</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИныеУсловияДоговора</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Грейд</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Территория</name>
      <type>
        <types>CatalogRef.ТерриторииВыполненияРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешениеНаРаботу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазрешениеНаПроживание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловияОказанияМедпомощи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПКУ</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияЕСВ</name>
      <type>
        <types>CatalogRef.КатегорииЗастрахованныхЛицЕСВ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринятНаНовоеРабочееМесто</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСозданияРабочегоМеста</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РаботаСНефиксированнымРабочимВременем</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЕжегодныеОтпуска</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЕжегодногоОтпуска</name>
      <type>
        <types>CatalogRef.ВидыОтпусков</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейВГод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Льготы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Льгота</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/Documents/ПриемНаРаботуСписком/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Функция ДобавитьКомандыСозданияДокументов(КомандыСозданияДокументов, ДополнительныеПараметры) Экспорт
	
	ЗарплатаКадрыРасширенный.ДобавитьВКоллекциюКомандуСозданияДокументаПоМетаданнымДокумента(
		КомандыСозданияДокументов, Метаданные.Документы.ПриемНаРаботуСписком);
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхДляНачисленияЗарплаты,ЧтениеДанныхДляНачисленияЗарплаты", , Ложь) Тогда
		
		// Бронирование позиции
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьКадровыхПриказовРасширенная";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПодтверждениеБронированияПозиции";
		КомандаПечати.Представление = НСтр("ru='Подтверждение брони';uk='Підтвердження броні'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ФункциональныеОпции = "ИспользоватьБронированиеПозиций";
			
		// Приказ о приеме
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьКадровыхПриказовРасширенная";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриемСотрудников";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru='Приказ о приеме';uk='Наказ про прийом'");
		КомандаПечати.ДополнительныеПараметры.Вставить("ТребуетсяЧтениеБезОграничений", Истина);
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
	КонецЕсли;
	
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеКадровогоСостоянияРасширенная,ЧтениеКадровогоСостоянияРасширенная", , Ложь) Тогда
		
		// Трудовой договор
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьКадровыхПриказовРасширенная";
		КомандаПечати.Идентификатор = "ПФ_MXL_ТрудовойДоговор";
		КомандаПечати.Представление = НСтр("ru='Трудовые договоры';uk='Трудові договори'");
		КомандаПечати.Порядок = 20;
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
	КонецЕсли;
	
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеКадровогоСостоянияРасширенная,ЧтениеКадровогоСостоянияРасширенная", , Ложь) Тогда
		
		// Трудовой договор при дистанционной работе.
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьКадровыхПриказовРасширенная";
		КомандаПечати.Идентификатор = "ПФ_MXL_ТрудовойДоговорПриДистанционнойРаботе";
		КомандаПечати.Представление = НСтр("ru='Трудовые договоры при дистанционной работе';uk='Трудові договори при дистанційній роботі'");
		КомандаПечати.Порядок = 30;
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		Модуль.ДобавитьКомандыПечатиДокументаПриемНаРаботу(КомандыПечати);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолныеПраваНаДокумент() Экспорт 
	
	Возврат Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхДляНачисленияЗарплатыРасширенная, ЧтениеДанныхДляНачисленияЗарплатыРасширенная", , Ложь);
	
КонецФункции	

Функция ДанныеДляПроверкиОграниченийНаУровнеЗаписей(Объект) Экспорт 
	
	ДанныеДляПроверкиОграничений = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудники", Объект.Сотрудники.Выгрузить(, "Подразделение,ФизическоеЛицо"));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриемНаРаботуСпискомСотрудники.Подразделение КАК Подразделение,
		|	ПриемНаРаботуСпискомСотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	&Сотрудники КАК ПриемНаРаботуСпискомСотрудники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.Подразделение КАК Подразделение,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТСотрудники КАК Сотрудники
		|
		|УПОРЯДОЧИТЬ ПО
		|	Подразделение,
		|	ФизическоеЛицо";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Подразделение") Цикл
		
		ОписаниеСтруктурыДанных = ЗарплатаКадрыРасширенный.ОписаниеСтруктурыДанныхДляПроверкиОграниченийНаУровнеЗаписей();
		ОписаниеСтруктурыДанных.Организация = Объект.Организация;
		ОписаниеСтруктурыДанных.Подразделение = Выборка.Подразделение;
		
		Пока Выборка.Следующий() Цикл
			Если ОписаниеСтруктурыДанных.МассивФизическихЛиц = Неопределено Тогда
				ОписаниеСтруктурыДанных.МассивФизическихЛиц = Новый Массив;
			КонецЕсли; 
			ОписаниеСтруктурыДанных.МассивФизическихЛиц.Добавить(Выборка.ФизическоеЛицо);
		КонецЦикла; 
		
		ДанныеДляПроверкиОграничений.Добавить(ОписаниеСтруктурыДанных);

	КонецЦикла;
	
	Возврат ДанныеДляПроверкиОграничений;
	
КонецФункции

#КонецОбласти

#КонецЕсли
